upf_version 3.0
create_power_domain PD_TOP -elements {dashcam_soc_top}
create_supply_port VDD
create_supply_port VSS
create_supply_net VDD
create_supply_net VSS
connect_supply_net VDD -ports VDD
connect_supply_net VSS -ports VSS
set_domain_supply_net PD_TOP -primary_power_net VDD -primary_ground_net VSS
